package com.javarush.task.pro.task07.task0702;

/* 
Максимальное целое
Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
Этим переменным присвой максимально возможное для них значение.
Никаких методов создавать не нужно.


Requirements:
1. В классе Solution должны быть созданы переменные всех примитивных целочисленных типов.
2. Всем целочисленным переменным должно быть присвоено максимально возможное для них значение.
3. В классе Solution не должно быть создано никаких методов.
*/

public class Solution {
    byte a = 127;
    short b = 32767;
    int c = 2147483647;
    long d = 9223372036854775807L;
}
