package com.javarush.task.task01.task0101;

/* 
Я думаю, быть программистом круто
Напиши программу, которая выводит на экран надпись:

Я думаю, быть программистом круто


Requirements:
1. Программа должна выводить текст.
2. Текст должен начинаться с "Я думаю".
3. Текст должен заканчиваться на "круто".
4. Текст должен состоять из 33 символов, включая пробелы и знаки препинания.
5. Текст должен состоять из одной строки.
6. Выводимый текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Я думаю, быть программистом круто");
    }
}
