package com.javarush.task.pro.task04.task0413;

/* 
Рисуем треугольник
Давай используем цикл for, чтобы вывести на экран прямоугольный треугольник из восьмёрок со сторонами (катетами) 10 и 10.
То есть в первой строке должна быть одна 8, начиная слева, во второй - две и т.д.

Пример вывода на экран:
8
88
888
8888
88888
888888
8888888
88888888
888888888
8888888888


Requirements:
1. Программа должна выводить числа на экран.
2. Программа должна выводить прямоугольный треугольник из восьмёрок со сторонами 10 и 10.
3. В программе необходимо использовать цикл for.
4. Вывод на экран должен происходить в цикле for.
*/

public class Solution {
    public static void main(String[] args) {
        for (int i = 1; i < 11; i++) {
            for (int j = 1; j < i+1; j++) {
                System.out.print("8");
            }
            System.out.println();
        }
    }
}