package com.javarush.task.pro.task07.task0703;

/* 
Минимальное целое
Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
Этим переменным присвой минимально возможное для них значение.
Никаких методов создавать не нужно.

Requirements:
1. В классе Solution должны быть созданы переменные всех примитивных целочисленного типов.
2. Всем целочисленным переменным должно быть присвоено минимально возможное для них значение.
3. В классе Solution не должно быть создано никаких методов.
*/

public class Solution {
    byte a = -128;
    short b = -32768;
    int c = -2147483648;
    long d = -9223372036854775808L;
}
